#pragma once

//========================================
//##				게임씬				##
//========================================

enum SceneType
{
	Title,
	Stage01,

	SceneSize,
};

//========================================
//##				레이어				##
//========================================

enum Layer
{
	Default,
	Player,
	Monster,
	Missile,
	Ground,

	LayerSize,
};

//========================================
//##				플레이어				##
//========================================

enum class PlayerState
{
	Idle,
	Run,
	Jump,
	Fall,
};